swt/principles_of_software_engineering.html
---
layout: page
title: Principles_of_software_engineering
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prinzipien des Software-Engineering</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Abstraktion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Enwicklung eines Modells zur Repräsenation ausgewählter Aspekte einer
Vorlage (z.B. der Außenwelt, oder einer anderen Klasse).
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Strukturierung</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Unterteilung von in Prozessen und Produkten in einzelne Bestandteile
u.a. zum Zweck der Arbeitsteilung. Strukturiert wird in der
SW-Entwicklung:
</p>

<ul class="org-ul">
<li>zeitliche Strukturierung: Unterteilung des Entwicklungsprozesses in
verschiedene Phasen
</li>
<li>Unterteilung der SW in verschiedene Bestandteile (s.a.
Modularisierung)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Modularisierung</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Aufbau eines Gesamtsystems aus Einheiten (Modulen). Ziel von
Modularisierung ist hohe Kohäsion und geringe Kopplung.
</p>

<ul class="org-ul">
<li><b>Kohäsion</b>: Grad der Abhängigkeit zwischen Komponenten <i>desselben</i>
   Moduls
</li>
<li><b>Kopplung</b>: Grad der Abhängigkeit zwischen Modulen
</li>
</ul>

<p>
Modularisierung unterstützt:
</p>

<ul class="org-ul">
<li>Kapselung (Information Hiding)
</li>
<li>Separation of Concernes
</li>
<li>Wiederverwertung
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Kapselung</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Kapselung bezeichnet das gezielte Verstecken von Details (der
Implementierung) eines Moduls vor Zugriffen von außen. Kapselung
unterstützt:
</p>

<ul class="org-ul">
<li>Separation of Concerns
</li>
<li>Modularisierung
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Separation of Concerns</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Aufteilung von Zuständigkeiten/Verantwortlichkeiten bei der
SW-Entwicklung, wie z.B.:
</p>

<ul class="org-ul">
<li>Aufteilung der Funktionalität einer SW auf Module
</li>
<li>Arbeitsteilung in Entwicklerteams
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Änderbarkeit</h3>
<div class="outline-text-3" id="text-1-6">
<p>
SW soll leicht veränderbar gestaltet werden um die Wartung von SW zu
vereinfachen:
</p>

<ul class="org-ul">
<li>korrektive Wartung: Beseitigung von Fehlern
</li>
<li>perfektive Wartung:
</li>
<li>adaptive Wartung: Anpassung von SW an veränderte Rahmenbedingungen
</li>
<li>inkrementelle Wartung
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Inkrementabilität</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Schrittweises entwickeln von SW (z.B. erst Entwicklung von Modulen, dass
Integration der Module).
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Gründlichkeit &amp; Formalität</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Umfasst u.a.:
</p>

<ul class="org-ul">
<li>formale Spezifikation von Anforderungen an eine SW
</li>
<li>formale Dokumentation einer SW
</li>
<li>formale Verifikation einer SW
</li>
</ul>
</div>
</div>
</div>
